[
    {
        "rating": 5,
        "content": "This app has helped me pass my permit twice. Because of this his app it started my journey to driving a B-class and now an A-class CMV. Highly recommend this app. I’ve tried other ones and I found this one a mile above the rest. Purchasing the pro version is definitely worth every penny.",
        "userName": "Stevenforbz",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "This app is pretty neat, it helps you to track your date of when your going to take the exam and preps you a plan for the future event. As well as repeats the wrong answers you had gotten to make sure you remember them. Very good app so far.",
        "userName": "miamiblu305",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "Used this to get my CDL the first time and using it to brush up on my hazards for renewal. (Don’t drive hazard but want to keep it) \n\nThe app for the questions appears as website links but the options are still available. Just the question is not what it should be",
        "userName": "Austin Cash",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "I have a text today and I am hoping I pass. Sor far I love how it explains it to me. I do better in question then to read the book... I have adhd and I can’t concentrate reading. So I found a way to help me study it",
        "userName": "eddiemom215",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "This app was suggested by the officer at the DMV who is the actual tester. After check four other apps I find this one to be easiest to use and spot on compared to any of the other study apps and is closest to what is on the test. This is a accurate and great app!!",
        "userName": "slowrollerky",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "There are some questions with more than one correct answer, but they don’t include it in the answer. Mostly great stuff though. An editor should go back through the questions again and remove and correct them.",
        "userName": "Jrhr1122",
        "appKey": "ccna",
        "appName": "CCNA"
    },
    {
        "rating": 4,
        "content": "App is well worth the practice sessions it has. Also this is a app meant for ipads but it still works relatively well with minor discrepancies.ads displaying sideways but that does not take away from the learning aspect of the app.",
        "userName": "Layo 757",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "I’m trying to take screen shots for myself and myself only. To write down later on so I can study and memorize certain things. But the whole explanation of the answer doesn’t fit in the screen. There is to much spacing.",
        "userName": "Jus42n",
        "appKey": "part107",
        "appName": "Part"
    },
    {
        "rating": 5,
        "content": "I passed the general knowledge test by just studying this app!! This app has definitely helped me to build my confidence to move forward. I’m so excited and ready to take my air brakes and combination test. \n\nWho ever created this app did a wonderful job!! Thank you for helping me!",
        "userName": "SRKADVIS",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "I find this app to be perfect for those who are studying and want to pass the Comptia A+ certification. It’s easy to use and gives you tips on what you missed. A definite must have if your just getting into I.T.",
        "userName": "Domo1217",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "I love this app because before using it, every time I would go to the DMV and take my permit I would fail it every time. Ever since I came across the app everything seemed to be so much easier and I went back to take the permit and I passed it.",
        "userName": "Fanelisa",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 5,
        "content": "I paid $2k for a in-class course and it wasn’t helpful at all. In fact, the instructor was mostly providing us incorrect information. This app only cost me $10 and I am close to getting ready to take the exam.",
        "userName": "SSRahim",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "I’m using the free version, mainly for science. The Mometrix book does a great job at covering all subjects but I need to really test/practice my knowledge for science. I find the science questions in this app to be relevant. So far, so good for being a free app.",
        "userName": "sks627",
        "appKey": "teas",
        "appName": "TEAS"
    },
    {
        "rating": 5,
        "content": "Not only do you study all the subjects on the ASVAB, your able to see the questions that have you stuck as well with the ones you understand,, they also have multiple practice ASVAB test as well ,,, pretty dope have to say",
        "userName": "Hones-E",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "A truly invaluable tool for making quick and easy progress towards a cert. Everything is excellent but I would love to see the app retain its session information because I have to restore purchases every time the app is suspended.",
        "userName": "freeze.blink",
        "appKey": "comptiasecurity",
        "appName": "CompTIA Security+"
    },
    {
        "rating": 5,
        "content": "\tI really like the explanations and variety of questions. Sorry for the typo there initially. But yeah, so far the layout of the app is user friendly. The explanations help understand why the correct answer is correct and the incorrect answer is incorrect.",
        "userName": "Jana Macklin",
        "appKey": "comptiaa",
        "appName": "CompTIA A+"
    },
    {
        "rating": 5,
        "content": "\tI'm not finished yet, but so far, I'm learning and getting more confident that I'll be ready to retake the CompTIA Exam. The app is very good at asking questions in a similar way as the actual exam would, which is key for anyone looking to pass.",
        "userName": "Dre Holloway",
        "appKey": "comptiaitf",
        "appName": "CompTIA ITF+"
    },
    {
        "rating": 5,
        "content": "This app is very use to use and quick to get started with.  It monitors one’s progress to keep you motivated. The best thing is that set realistic deadlines to move you to take the test fully ready and without procrastinating.",
        "userName": "Tsukiz3",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 5,
        "content": "i took (and passed) the AWS CCP exam in May 2020 and have to recertify in a few months.  this app has been super great as a review resource so i can take the exam again and hopefully, pass again when it comes around.",
        "userName": "texasstryker",
        "appKey": "clfc01",
        "appName": "CLF-C01"
    },
    {
        "rating": 5,
        "content": "I just started using this, made by the army, it’s pretty easy to use and I’m looking forward to using it, plus premium for a YEAR is only like $20 so I think it’s far worth it, it is still free though!",
        "userName": "Nish2207",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 4,
        "content": "You will find mistakes but you can't report it, this is an example: The pump level could have up to 3 INCHS IN PLAY. But as usual, developers doesn't want to know they made a mistake, nor correct them. The believe to be perfect, but this is not, pretty good, yes , but not excellent.",
        "userName": "Budrus58",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 4,
        "content": "This app is really good with studying and I’ve been using it for a month now. All of a sudden, it’s no longer free? You can only do Part 1 for each topic instead of all of them. I remember being able to do all them with ads. What happen?",
        "userName": "VMiranda1995",
        "appKey": "comptiasecurity",
        "appName": "CompTIA Security+"
    },
    {
        "rating": 5,
        "content": "Love the app. I don’t pay for the upgraded version but I like how when I’m taking the tests that it gives you the correct answer if I get it wrong and then comes back later on and asks the question again until I get it right. Great learning tool!",
        "userName": "BGZ4SHZ",
        "appKey": "epa608",
        "appName": "EPA"
    },
    {
        "rating": 5,
        "content": "I’m using this app to review my knowledge after studying each Domain. It really asked me questions about what I already studied and also ask the same question in different ways.\n\nIt’s pretty good, I will recommend to add this to your CCP study resources.",
        "userName": "vikluk",
        "appKey": "awscp_old",
        "appName": "AWS CCP"
    },
    {
        "rating": 5,
        "content": "I’m using this app to study for my permit test and it is so useful!! Easy to study for your DMV test with or without the manual. I had sent a request to change one part of the app and they gladly complied to my request which I was very happy to see! Definitely recommend~",
        "userName": "Tammy Dinh",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 5,
        "content": "I had to download this one cause the one I was using became out of date and it recommended this one! Very awesome!! I have a hard time following the book when I read it and this app helps me understand so much more than what I was reading.",
        "userName": "sierra__02",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 5,
        "content": "I love how you can click show me details after answering a question and it explains why the other options were not the right answer. It is really helping me to retrieve the information I have studied and figure out where I need to study more.",
        "userName": "AnsariD",
        "appKey": "comptianetwork",
        "appName": "CompTIA Network+"
    },
    {
        "rating": 5,
        "content": "It allows you to break down and master different categories so you can work more in what you know your struggling with, it lays out a plan for success based on what you want to know and how much time you have to do so. Great study tool for national registry",
        "userName": "teob5000",
        "appKey": "emtb",
        "appName": "EMT-B"
    },
    {
        "rating": 5,
        "content": "Passed Friday Sec+ 601\n\nUse the app every where, standing in line, waiting, after meals, on trains, etc. Turn off social media and just do questions. Watch dion or messer videos.  \n\nDo all the questions and a few practice tests.  Commit to learning.",
        "userName": "Zdr6",
        "appKey": "comptiasecurity",
        "appName": "CompTIA Security+"
    },
    {
        "rating": 5,
        "content": "Only had one week to study for a retest and only needed 2 more points for the job I wanted. I scored 10 more than needed in only a week. Also saw many similar questions or questions that helped with other questions only using this app. Great tool to help you get the score you want.",
        "userName": "icemannn4",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "I’m in a school for CDL, and I used this app for test prep. I tested this morning, 3 written ( computer ) tests. The app was exact on the questions I got. I bought the advanced version to be safe. This app is worth way more that the upgrade I paid. Thank you app developers, CDL Prep.",
        "userName": "Kcmyway",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "I knew next to nothing and passed general, air brakes and combination 2 weeks later. Got 98 out of 100 questions correct on the Colorado test. Only saw one question on the DMV test that I feel the app didn’t prepare me for.",
        "userName": "Novagator",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "I have taken my permit three times. The first I couldn’t pass. I downloaded this app 4 days before my test and I passed with flying colors!!!! I recommend this app. Please try it before you go buying others.",
        "userName": "🥺😘😝🧐",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 4,
        "content": "I purchased the pro version and love it! I wish it would tell you what you should focus more on studying. Also, the pass rate % confuses me it says I need to complete 34 questions daily but when I do the percentage doesn’t go up to 94%.",
        "userName": "ndyxheb",
        "appKey": "hiset",
        "appName": "HISET"
    },
    {
        "rating": 5,
        "content": "Loving this app. Explains why each answer is the correct answer. Any question not answered correctly on the first attempt is gone over at the end of each part and taken again. Very simple, straightforward, and resourceful.",
        "userName": "DéCoy",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "Just getting into trucking, my older brother being a 22 year veteran driver he is mentoring me and sent me that app to download. I studied with only this app, no CDL manual, and this app was the only tool I used and passed 1st try. Highly recommend.",
        "userName": "Ozzy Dotson",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "Really liking the app so far. Very intuitive. I feel it does provide similar concepts and scenarios that I am receiving from my graduate level courses in project management and also feel confident it will help me pass my PMP examination. Will see next month!",
        "userName": "WMSCrypto",
        "appKey": "pmp",
        "appName": "PMP"
    },
    {
        "rating": 5,
        "content": "This company helped me pass my Security+ exam. Now I’m studying for my AWS certification. The app is convenient and easy to use. You just need to be disciplined enough to keep consistent! For preparation, It works like a charm!",
        "userName": "Deonte W.",
        "appKey": "awscertifiedsolutionsarchitect",
        "appName": "AWS"
    },
    {
        "rating": 5,
        "content": "I just purchased this app for study purposes and I have to say that I've made a wonderful investment. It's easy to navigate and you clear explanations on questions you've missed. I feel confident that when I go take my compTIA exam, I will ace it on the first try. Again thanks for this app.",
        "userName": "rahiim",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "I’ve only made my way a little through the app, but so far the information is very similar to what I have in my book and the online study material I have found through other resources. \n\nThis app is a great way to study on the go.",
        "userName": "Nelsonjg",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "Had to renew CDL I have the HAZMAT endorsement so had to take the test.  This APP prepaid me for the test. It was the best. It helped me a great deal. I would recommend to anyone that is taking the CDL test for hazmat",
        "userName": "Jorge g 2011",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "Each practice sections give explanations of each question after every question. Commercial shows up after each section/ module, which is fine with me. It probably help them offset in maintaining the app. This is a 100% free apps with a lot sections and practice quizzes.",
        "userName": "PN78999",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "Non intrusive well designed ASVAB work plans entailing every section of the test, rerunning questions until you master them. Sit down with a notepad and pen, enter a flow, and feel yourself get more and more ready for the entrance exam.",
        "userName": "Cyda Rouxe",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "So far so good! Very helpful and easy to use. Not to many ads and complications like other apps I have tried and it’s free to practice. Not sure if you could pay for an advanced feature but the basic app is all I need. Good app!",
        "userName": "RickyZel",
        "appKey": "dmv",
        "appName": "DMV Practice Test"
    },
    {
        "rating": 5,
        "content": "i took (and passed) the AWS CCP exam in May 2020 and have to recertify in a few months.  this app has been super great as a review resource so i can take the exam again and hopefully, pass again when it comes around.",
        "userName": "texasstryker",
        "appKey": "awscp_old",
        "appName": "AWS CCP"
    },
    {
        "rating": 4,
        "content": "I learned a lot from this app. However in the end, I gave it a 4 star since the questions were more confusing and didn't understand the exact point it was asking.  Different from trick questions... since you would at least know what it's asking but have to really think of your answer.",
        "userName": "ppansu",
        "appKey": "comptiasecurity",
        "appName": "CompTIA Security+"
    },
    {
        "rating": 4,
        "content": "The only point i didn’t like is that you can’t copy any word in the app. I want to copy sentences in app for translate because of my english not very well. The app don’t let me copy so i am suffering with typing for translate.",
        "userName": "Bugra93",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "Today is 8/31/2023 I’m currently in my drone class and wanted a little more practice so i download this app and we will see how much it will help. I take my test in less than a month so we will see so far so good.",
        "userName": "KD DYNASTY",
        "appKey": "part107",
        "appName": "Part"
    },
    {
        "rating": 5,
        "content": "Someone else recommended this app so I could get my Class A. This app didn’t let me down on my first try I passed all my permits. \n\nI highly recommend this app I paid for the premium version to support the developer.",
        "userName": "Jayb_81",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "The questions stimulate you, and their explanations are AMAZING. Read the answers even if you get them right. Also, really high value for free. Questions are easier than exam tho (actual exam is unbelievable).",
        "userName": "wariofart",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "I just downloaded this app today, however, I was happy to find out that I could take a test for free and the best part of all, it provides an explanation when you fail a question which helps you understand where you were wrong.",
        "userName": "Parce91",
        "appKey": "comptianetwork",
        "appName": "CompTIA Network+"
    },
    {
        "rating": 5,
        "content": "This app is very generous and focused on learning! I am currently working through the sections and I appreciate that the quizzes shuffle in incorrect answers so you have another chance of answering them instead of restarting. \nI would love to have a network+ version",
        "userName": "MushiRoomz",
        "appKey": "comptiasecurity",
        "appName": "CompTIA Security+"
    },
    {
        "rating": 5,
        "content": "If you are really and truly serious about obtaining your CDL A license, this app is the only one you need the questions that the DMV have on their test are the same ones word for word on this app you just have to study!",
        "userName": "ToneySgator",
        "appKey": "cdl",
        "appName": "CDL"
    },
    {
        "rating": 5,
        "content": "This is a great app to resort to, especially to prepare yourself before hand. Study everything you need to know or study literally everything.. Why not? This app has almost everything you need to know to pass.",
        "userName": "RivasJordan",
        "appKey": "asvab",
        "appName": "ASVAB"
    },
    {
        "rating": 5,
        "content": "I really love how you can set a deadline goal for yourself and the app will lyk how many questions you must master a day to be ready for the exam. I’m aslo glad that explanations are provided for questions you get wrong and that you’re able to re-take them!",
        "userName": "Error-N",
        "appKey": "comptiaa",
        "appName": "Comptia A+"
    },
    {
        "rating": 5,
        "content": "This tool is a great design to ask questions to check knowledge while giving explanations where needed to understand the correct information for future answers.\n\nStill deciding on pay version.  Ad. version is highly useful. Thank you!",
        "userName": "GTRevenor",
        "appKey": "comptianetwork",
        "appName": "CompTIA Network+"
    }
]
